Autodesk.Navisworks.Api.PublishProperties.EmbedTextures
Should any externally referenced files be embedded in the published file ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.PreventObjectPropertyExport
Should normal object properties be removed from the published file ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only